import * as _ from "underscore";

export let GRandomNameCfg = {
    "FirstName":[
        "赵","钱","孙","李",
        "周","吴","郑","王",
        "冯","陈","褚","卫",
        "蒋","沈","韩","杨",
        "朱","秦","尤","许",
        "何","吕","施","张",
        "孔","曹","严","华",
        "金","魏","陶","姜",
        "戚","谢","邹","喻",
        "柏","水","窦","章",
        "云","苏","潘","葛",
        "奚","范","彭","郎",
        "鲁","韦","昌","马"
    ],
    "LastMaleName":[
        "之玉","越泽","锦程","修杰",
        "烨伟","尔曼","立辉","致远",
        "天思","友绿","聪健","修洁",
        "访琴","初彤","谷雪","平灵",
        "源智","烨华","振家","越彬",
        "子轩","伟宸","晋鹏","觅松",
        "海亦","雨珍","浩宇","嘉熙",
        "志泽","苑博","念波","峻熙",
        "俊驰","聪展","南松","问旋",
        "黎昕","谷波","凝海","靖易",
        "芷烟","渊思","煜祺","乐驹",
        "风华","睿渊","博超","天磊",
        "夜白","初晴","瑾瑜","鹏飞"
    ],
    "LastFemaleName":[
        "醉易","紫萱","紫霜","紫南",
        "紫菱","紫蓝","紫翠","紫安",
        "芷天","芷容","芷巧","芷卉",
        "芷荷","之桃","元霜","元绿",
        "元槐","元枫","语雪","语山",
        "语蓉","语琴","语海","语芙",
        "语儿","语蝶","雨雪","雨文",
        "雨梅","雨莲","雨兰","幼丝",
        "幼枫","又菡","友梅","友儿",
        "映萱","映安","迎梦","迎波",
        "易巧","亦丝","亦巧","忆雪",
        "忆文","忆梅","忆枫","以丹",
        "依丝","夜玉","夜梦","夜春"
    ],
    getRandomName()
    {
        let len = this.FirstName.length
        let index = _.random(len-1)
        let first = this.FirstName[index]
        let lasts = null
        if(Math.random()>0.7)
        {
            lasts = this.LastFemaleName
        }
        else
        {
            lasts = this.LastMaleName
        }
        len = lasts.length
        index = _.random(len-1)
        let last = lasts[index]
        return first+last
    }
}